{
    "table_header": [
        [
            "Рекоммендуемый срок",
            "Инфекционное заболевание",
            "Основание",
            "",
            ""
        ],
        [
            "",
            "",
            "Региональный календарь профилактических прививок по Свердловской области (утвержден Приказом МЗ СО от 11 августа 2022г. N 1881 - п)",
            "Национальный календарь профилактических прививок (утвержден Приказом МЗ РФ от 6 декабря 2021 г. N 1122-н)",
            "Календарь профилактических прививок по эпидемическим показаниям (утвержден Приказом МЗ РФ от 6 декабря 2021 г. N 1122-н)"
        ]
    ],
    "text_top": [
        "Уведомление о необходимости прохождения иммунизации",
        "Уважаемый(-ая) !",
        "Уведомляем вас, что в 2024 году ВЫ подлежите иммунизации против : ",
        "Предлагаем вам пройти иммунизацию согласно графику, прописанному в уведомлении, в срок не позднее 1 месяца с начала периода, предложенного в графике по профилактике конкретного заболевания, и предоставить данные старшей медсестре отделения, для дальнейшего планирования последующих этапов иммунизации",
        "В случае отказа от прохождения иммунизации Работодатель оставляет за собой право отстранять своего сотрудника от работы в рамках действующего законодательства без сохранения заработной платы"
    ],
    "text_bot": [
        "Дата <<_____>>___________202_г.",
        "Подпись направляемого на иммунизацию (с расшифровкой)_____________/___________",
        "Подпись сотрудника эпидемиологического отдела ___________/____________"
    ],
    "text_bot2": [
        "Дополнительную информацию, что в соответствии с Приложением №2 Приказом МЗ СО от 17 сентября 2024 г. № 2208-п:",
        "П.8  Допускается введение вакцин (за исключением вакцин для профилактики туберкулеза),применяемых в рамках национального календаря профилактических прививок, календаряпрофилактических прививок по эпидемическим показаниям, регионального календаря профилактическихпрививок Свердловской области, регионального календаря профилактических прививок Свердловскойобласти по эпидемическим показаниям в один календарный день разными шприцами в разные участки тела(одномоментно)… Для вакцин, имеющих один и тот же антигенный состав, интервал в рамках первичногокомплекса прививок должен составлять минимум 1 месяц. Вместе с тем, в настоящее время в соответствии смеждународной практикой, допускается введение неживых вакцин с любым интервалом между собой, привведении живых вакцин рекомендуется интервал 1 месяц, между живой и неживой вакцинами, такжедопустим любой интервал.",
        "П.11 Иммунизация в рамках регионального календаря вакцинами, не входящими в национальныйкалендарь профилактических прививок и календарь профилактических прививок по эпидемическимпоказаниям, проводится за счет средств муниципальных образований, средств граждан и другихисточников, не запрещенных законодательством."
    ],
    "scope_work": {
        "Медик": [
            "Грипп",
            "Дизентерия Зонне",
            "Клещевой энцефалит",
            "НКВИ",
            "Корь",
            "Гепатит А",
            "Гепатит B"
        ],
        "Не медик": [
            "Грипп",
            "Коклюш",
            "Гепатит А",
            "Гепатит B",
            "Корь",
            "Краснуха"
        ],
        "Работник пишеблока": [],
        "Коммунальное обслуживание": []
    },
    "vaccination": {
        "Грипп": {
            "0": [
                0,
                "RV"
            ],
            "RV": [
                365,
                "RV"
            ]
        },
        "НКВИ": {
            "0": [
                0,
                "RV"
            ],
            "RV": [
                365,
                "RV"
            ]
        },
        "Дизентерия Зонне": {
            "0": [
                0,
                "RV"
            ],
            "RV": [
                365,
                "RV"
            ]
        },
        "Клещевой энцефалит": {
            "0": [
                0,
                "V1"
            ],
            "V1": [
                91,
                "V2"
            ],
            "V2": [
                365,
                "RV1"
            ],
            "RV1": [
                1096,
                "RV1"
            ]
        },
        "Корь": {
            "0": [
                0,
                "V"
            ],
            "V": [
                183,
                "RV"
            ],
            "RV": [
                0,
                "RV"
            ]
        },
        "Краснуха": {
            "0": [
                0,
                "V"
            ],
            "V": [
                31,
                "RV"
            ],
            "RV": [
                0,
                "RV"
            ]
        },
        "Дифтерия, столбняк": {
            "0": [
                0,
                "V1"
            ],
            "V1": [
                40,
                "V2"
            ],
            "V2": [
                183,
                "RV1"
            ],
            "RV1": [
                3652,
                "RV"
            ],
            "RV": [
                3652,
                "RV"
            ]
        },
        "Гепатит B": {
            "0": [
                0,
                "V1"
            ],
            "V1": [
                30,
                "V2"
            ],
            "V2": [
                183,
                "V3"
            ],
            "V3": [
                1826,
                "RV"
            ],
            "RV": [
                1826,
                "RV"
            ]
        },
        "Гепатит А": {
            "0": [
                0,
                "V1"
            ],
            "V1": [
                244,
                "V2"
            ],
            "V2": [
                0,
                "V2"
            ]
        },
        "Коклюш": {
            "0": [
                0,
                "V1"
            ],
            "V1": [
                40,
                "V2"
            ],
            "V2": [
                183,
                "RV1"
            ],
            "RV1": [
                3652,
                "RV"
            ],
            "RV": [
                3652,
                "RV"
            ]
        },
        "Ветряная оспа": {
            "0": [
                0,
                "V1"
            ],
            "V1": [
                91,
                "V2"
            ],
            "V2": [
                0,
                "V2"
            ]
        },
        "Пневмококковая инфекция": {
            "0": [
                0,
                "V1"
            ],
            "V1": [
                56,
                "V2"
            ],
            "V2": [
                1826,
                "RV"
            ],
            "RV": [
                0,
                "RV"
            ]
        }
    }
}